[
    {"text_ar":"عند وصول ساعة الحرارة إلى المنطقة (H) فإنه یجب علیك:","text_en":"When the temperature gauge reaches the (H) zone, you should:","options_ar":["إیقاف سیارتك في مكان آمن لاتخاذ الإجراء الضروري .","إیقاف سیارتك في أي مكان في الطریق فورا لاتخاذ الإجراء الضروري .","متابعة المسیر في السیارة حتى تصل اقرب كراج.","لاشيء مما ذكر."],"options_en":["Stop your car in a safe place to take the necessary action.","Stop your car anywhere on the road immediately to take necessary action.","Continue driving until you reach the nearest garage.","None of the above."],"imageURL":null,"correctIndex":0},
    {"text_ar":"قد یحشر رأس أو ید الطفل في النافذة إذا عبث بمفتاح النافذة الكھربائي.","text_en":"A child's head or hand may get trapped in the window if they tamper with the electric window switch.","options_ar":["نعم","لا"],"options_en":["Yes","No"],"imageURL":null,"correctIndex":0},
    {"text_ar":"یمكن لمسند الرأس أن یحمیك إذا كان مضبوطا بًصورة صحیحة:","text_en":"The headrest can protect you if it is correctly adjusted:","options_ar":["نعم","لا"],"options_en":["Yes","No"],"imageURL":null,"correctIndex":0},
    {"text_ar":"یحمي حزام الأمان النساء الحوامل في حال وقوع حادث مروري.","text_en":"Seat belts protect pregnant women in the event of a traffic accident.","options_ar":["نعم","لا"],"options_en":["Yes","No"],"imageURL":null,"correctIndex":0},
    {"text_ar":"من الاسعافات الاولیة للكسور المفتوحة","text_en":"First aid for open fractures includes:","options_ar":["عدم تعدّل كسر العظم","وضع الجبیرة المناسبة على مكان الكسر","استدعاء الإسعاف","جمیع ما ذكر."],"options_en":["Do not adjust the broken bone","Apply the appropriate splint to the fracture","Call for an ambulance","All of the above"],"imageURL":null,"correctIndex":3},
    {"text_ar":"من أھم الإسعافات الأولیة لكسور الظھر:","text_en":"The most important first aid for spinal fractures:","options_ar":["حصر تعاملك مع ھذه الحالة إلى أدنى مستوى ضروري","استدعاء الإسعاف","ترك المصاب في نفس وضعه الذي وجدته عليه لحين وصول الإسعاف.","جمیع ما ذكر."],"options_en":["Limit your handling of this case to the minimum necessary","Call for an ambulance","Leave the patient in the same position you found them until help arrives","All of the above"],"imageURL":null,"correctIndex":3},
    {"text_ar":"الاشیاء الموضوعة على الزجاج الأمامي أو أمام السائق تؤذي الركاب عند وقوع حادث .","text_en":"Objects placed on the windshield or in front of the driver can harm passengers in a crash.","options_ar":["نعم","لا"],"options_en":["Yes","No"],"imageURL":null,"correctIndex":0},
    {"text_ar":"من إجراءات الاسعافات الاولیة لایقاف النزیف:","text_en":"First aid steps to stop bleeding include:","options_ar":["الضغط المباشر على مكان النزیف بواسطة رباط ضاغط وذلك لإیقاف أي نوع من النزیف","وضع رباط حاصر على مسافة ٥-١٠ سم أعلى مكان النزیف لإیقاف النزیف الشریاني , أو أسفل مكان النزیف لإیقاف النزیف الوریدي","ا+ب"],"options_en":["Direct pressure on the bleeding site using a pressure band to stop any type of bleeding","Apply a tourniquet 5-10 cm above arterial bleeding or below venous bleeding","Both A and B"],"imageURL":null,"correctIndex":2},
    {"text_ar":"إذا ارتكب سائق المركبة حادث مروري ولاذ بالفرار من الموقع فأنة یحق لإفراد الأمن العام إلقاء القبض علیه بدون مذكرة:","text_en":"If a driver causes an accident and flees the scene, public security officers have the right to arrest them without a warrant:","options_ar":["نعم","لا"],"options_en":["Yes","No"],"imageURL":null,"correctIndex":0},
    {"text_ar":"یجوز لاي فرد من افراد الشرطة ان یلقي القبض دون مذكرة على سائق اي مركبة إذا:","text_en":"A police officer may arrest a driver without a warrant if:","options_ar":["تسبب في وفاة شخص او اصابته بسبب قیادة المركبة .","رفض التوقف لدوریة الشرطة","القیادة بعكس السیر","لاشئ مما ذكر"],"options_en":["Caused death or injury due to driving","Refused to stop for a police patrol","Driving in the wrong direction","None of the above"],"imageURL":null,"correctIndex":3},
    {"text_ar":"علیك التأكد من ان غطاء غرفة المحرك مؤمن بإحكام قبل قیادتك للسیارة.","text_en":"You should ensure the engine hood is securely fastened before driving the car.","options_ar":["نعم","لا"],"options_en":["Yes","No"],"imageURL":null,"correctIndex":0},
    {"text_ar":"ممكن نزع سدادة الرادیتر (المشع) عندما یكون المحرك ساخناً.","text_en":"It is possible to remove the radiator cap when the engine is hot.","options_ar":["نعم","لا"],"options_en":["Yes","No"],"imageURL":null,"correctIndex":1},
    {"text_ar":"یمكن أن یقذف الأطفال من السیارة عند وقوع حوادث في حالة عدم تثبیتھم بنظام آمن كحزام الأمان و/أو كرسي ألأطفال.","text_en":"Children can be ejected from the car in an accident if they are not secured with a seatbelt or child seat.","options_ar":["نعم","لا"],"options_en":["Yes","No"],"imageURL":null,"correctIndex":0},
    {"text_ar":"یدخل أول أكسید الكربون إلى غرفة السیارة إذا كانت أبواب السیارة مفتوحة.","text_en":"Carbon monoxide can enter the car cabin if the doors are open.","options_ar":["نعم","لا"],"options_en":["Yes","No"],"imageURL":null,"correctIndex":1},
    {"text_ar":"النزیف ھو خروج الدم من الأوعیة الدمویة ( الشرایین – الأوردة – الشعیرات الدمویة).","text_en":"Bleeding is the escape of blood from blood vessels (arteries, veins, capillaries).","options_ar":["نعم","لا"],"options_en":["Yes","No"],"imageURL":null,"correctIndex":0},
    {"text_ar":"یوفر حزام الأمان الحمایة التامة إذا كان المقعد في وضع مائل:","text_en":"The seatbelt provides full protection if the seat is reclined:","options_ar":["نعم","لا"],"options_en":["Yes","No"],"imageURL":null,"correctIndex":1},
    {"text_ar":"اذا حاول السائق الھرب من مكان حادث ارتكبه فإنه :","text_en":"If the driver tries to flee the scene of an accident they caused:","options_ar":["یجوز لاي فرد من افراد الشرطة ان یلقي القبض علیه دون مذكرة","لایجوز إلقاء القبض علیه ولكن یجب دفع قیمة المخالفه فقط.","لا شئ مما ذكر."],"options_en":["A police officer may arrest them without a warrant","They cannot be arrested but must pay the fine","None of the above"],"imageURL":null,"correctIndex":0},
    {"text_ar":"إندفاع البخار والماء الساخن عند فتح غطاء المشع (الردیتر) والبخار یتدفق من الحجیرة یؤدي إلى إصابتك بحروق .","text_en":"Hot steam and water can spray from the radiator when opening its cap, causing burns.","options_ar":["نعم","لا"],"options_en":["Yes","No"],"imageURL":null,"correctIndex":0},
    {"text_ar":"عند قیادة المركبة من قبل سائق تحت تأثیر الكحول أو أي من المؤثرات العقلیة التي تفقد سائقھا السیطرة على قیادتھا أو تناول الكحول أثناء القیادة :","text_en":"When a vehicle is driven by a driver under the influence of alcohol or any substance that impairs control, or while consuming alcohol during driving:","options_ar":["القبض من قبل أفراد الأمن العام على السائق بدون مذكرة","القبض من قبل أفراد الأمن العام على السائق بمذكرة","لاشيء مما ذكر"],"options_en":["Driver is arrested by public security without a warrant","Driver is arrested by public security with a warrant","None of the above"],"imageURL":null,"correctIndex":1},
    {"text_ar":"یوفر حزام الأمان الحمایة إذا كان المقعد في وضع قائم تقریباً.","text_en":"The seatbelt provides protection if the seat is in an almost upright position.","options_ar":["نعم","لا"],"options_en":["Yes","No"],"imageURL":null,"correctIndex":0},
    {"text_ar":"الاجراءات التي تتخذ لفاقد الوعي:","text_en":"Procedures for an unconscious person:","options_ar":["یجب استدعاء سیارة الإسعاف فورا","التأكد من أن المصاب یتنفس بشكل طبیعي","التأكد من أن قلبه یعمل.","جمیع ما ذكر."],"options_en":["Call an ambulance immediately","Ensure the person is breathing normally","Ensure the heart is working","All of the above"],"imageURL":null,"correctIndex":3},
    {"text_ar":"من أھم الإسعافات الأولیة لكسور الرقبة:","text_en":"The most important first aid for neck fractures:","options_ar":["عدم السماح للمصاب أن یمیل رقبته للامام أو الخلف أو من جانب إلى آخر","عدم تحریك المصاب","استدعاء الاسعاف","جمیع ما ذكر."],"options_en":["Do not allow the victim to tilt their neck forward, backward, or sideways","Do not move the victim","Call an ambulance","All of the above"],"imageURL":null,"correctIndex":3},
    {"text_ar":"من أھم اعراض وعلامات الكسور:","text_en":"The main symptoms and signs of fractures:","options_ar":["ان یشعر المصاب أو یسمع بطقطقة أحد العظام","ان یشعر المصاب بألم في مكان الإصابة","عدم قدرة المصاب على تحریك الجزء المكسور","جمیع ما ذكر."],"options_en":["Feeling or hearing a crack in the bone","Pain at the injury site","Inability to move the fractured part","All of the above"],"imageURL":null,"correctIndex":3},
    {"text_ar":"من الاسعافات الاولیة للكسور المفتوحة :","text_en":"First aid for open fractures:","options_ar":["یجب إزالة أو تقطیع الملابس حول مكان الإصابة","یجب العمل على السیطرة أو إیقاف النزیف","یجب تغطیة الجروح بضمادات مخصصة","جمیع ما ذكر."],"options_en":["Remove or cut clothing around the injury","Control or stop the bleeding","Cover the wounds with proper dressings","All of the above"],"imageURL":null,"correctIndex":3},
    {"text_ar":"من إجراءات التي تتخذ لفاقد الوعي:","text_en":"Actions to take for an unconscious person:","options_ar":["عدم نقل المصاب من مكان الحادث","عدم تجبیر أي جزء من جسمه.","أ + ب","لاشيء مما ذكر."],"options_en":["Do not move the person from the accident site","Do not splint any part of the body","Both A and B","None of the above"],"imageURL":null,"correctIndex":2},
    {"text_ar":"یجوز لاي فرد من افراد الشرطة ان یلقي القبض دون مذكرة على سائق اي مركبة في حال :","text_en":"A police officer may arrest a driver without a warrant if:","options_ar":["قیادة المركبة بطریقة متھورة او بصورة تشكل خطرا على مستعملي الطریق .","قیادة المركبة وھو تحت تاثیر الكحول او اي مخدر یفقده السیطرة على قیادتھا .","محاولة الھرب من مكان حادث ارتكبه .","جمیع ماذكر."],"options_en":["Driving recklessly or dangerously","Driving under the influence of alcohol or drugs","Attempting to flee the scene of an accident","All of the above"],"imageURL":null,"correctIndex":3},
    {"text_ar":"من الاسعفات الاولیة للكسور:","text_en":"First aid for fractures:","options_ar":["یجب المحافظة على المجرى الھوائي للمصاب مفتوحا وًالقیام بعملیة التنفس الصناعي عند اللزوم","استدعاء الإسعاف","الإبقاء على الأجزاء المصابة ثابتة بدون حركة","جمیع ما ذكر."],"options_en":["Keep the airway open and perform artificial respiration if needed","Call an ambulance","Keep the injured parts immobilized","All of the above"],"imageURL":null,"correctIndex":3},
    {"text_ar":"الاسباب الرئیسیة للكسور:","text_en":"Main causes of fractures:","options_ar":["حوادث السیارات","الحوادث المرتبطة بالسقوط على الأرض او من خلال ممارسة الأنشطة الریاضیة","جمیع ما ذكر."],"options_en":["Car accidents","Falls or sports activities","All of the above"],"imageURL":null,"correctIndex":2},
    {"text_ar":"یجوز لأي فرد البقاء في السیارة أثناء رفعھا بالرافعة (الجك)","text_en":"It is allowed for anyone to stay in the car while it is lifted with a jack:","options_ar":["نعم","لا"],"options_en":["Yes","No"],"imageURL":null,"correctIndex":1},
    {"text_ar":"من انواع النزیف:","text_en":"Types of bleeding:","options_ar":["نزیف خارجي وھو سیلان الدم خارج الجسم","نزیف داخلي وھو سیلان الدم داخل تجاویف الجسم مثل تجویف الجمجمة و الصدر و البطن والمفاصل","أ + ب","لا شيء مما ذكر."],"options_en":["External bleeding – blood flows outside the body","Internal bleeding – blood flows inside body cavities such as skull, chest, abdomen, or joints","Both A and B","None of the above"],"imageURL":null,"correctIndex":2},
    {"text_ar":"الحروق ھي عبارة عن إصابات تحدث في الجلد وانسجة الجسم الأخرى بسب:","text_en":"Burns are injuries to the skin and other body tissues caused by:","options_ar":["التعرض للشمس او الحرارة الجافة او الرطبة","المواد الكیماویة مثل الاحماض والقلویات والمواد المشعة","التیارات الكھربائیة","جمیع ما ذكر."],"options_en":["Sun or dry/wet heat exposure","Chemical substances like acids, alkalis, or radioactive materials","Electrical currents","All of the above"],"imageURL":null,"correctIndex":3},
    {"text_ar":"یجوز لاي فرد من افراد الشرطة اذا كانت المركبة غیر مسجلة او انتھى ترخیصھا لمدة تزید على ستة","text_en":"A police officer may act if a vehicle is unregistered or its license expired for more than six months:","options_ar":["حجز المركبة","إلقاء القبض على السائق.","إلزام السائق بدفع غرامه فقط.","لاشئ مما ذكر."],"options_en":["Impound the vehicle","Arrest the driver","Only require the driver to pay a fine","None of the above"],"imageURL":null,"correctIndex":1},
    {"text_ar":"یجوز تشغیل محرك السیارة المجھزة بناقل حركة تلقائي ( الجیر الأتوماتیك ) من خلال دفعھا وتعشیقھا.","text_en":"It is possible to start an automatic transmission car by pushing and engaging gears.","options_ar":["نعم","لا"],"options_en":["Yes","No"],"imageURL":null,"correctIndex":1},
    {"text_ar":"اذا تسبب سائق المركبة اثناء قیادتھا بوفاة انسان او تسبب باحداث عاھة دائمة فإنه:","text_en":"If a driver causes death or permanent disability while driving:","options_ar":["تحجز رخصة القیادة العائدة له","یعاقب بالحبس مدة من ثلاثة اشھر الى ثلاثة سنوات","وقف العمل برخصة القیادة مدة لاتقل عن ستة اشھر ولاتزید على السنتین","جمیع ماذكر صحیح"],"options_en":["Driver's license is confiscated","Punished with imprisonment from 3 months to 3 years","Suspension of license for 6 months to 2 years","All of the above"],"imageURL":null,"correctIndex":3},
    {"text_ar":"یجوز للأطفال الجلوس في أي منطقة في السیارة الغیر مجھزة بمقاعد الأمان الخاصة بالأطفال.","text_en":"Children may sit anywhere in a car not equipped with child safety seats.","options_ar":["نعم","لا"],"options_en":["Yes","No"],"imageURL":null,"correctIndex":1},
    {"text_ar":"تساعد أحزمة الامان في إبقاء السائق والراكب في موضعیھما الصحیحین.","text_en":"Seat belts help keep the driver and passengers in the correct position.","options_ar":["نعم","لا"],"options_en":["Yes","No"],"imageURL":null,"correctIndex":0},
    {"text_ar":"من إجراءات الاسعافات الاولیة للنزیف:","text_en":"First aid measures for bleeding:","options_ar":["طلب المساعدة الطبیة من خلال استدعاء الإسعاف فورا","العمل على إراحة المصاب من خلال وضعه على ظھره مع خفض الرأس عن مستوى الجسم","العمل على إیقاف النزیف.","جمیع ما ذكر."],"options_en":["Call for medical help immediately","Place the patient on their back with head lower than body","Stop the bleeding","All of the above"],"imageURL":null,"correctIndex":3},
    {"text_ar":"ان تناول الكحول یقلل من التركیز وسرعة الاستجابة عند القیادة.","text_en":"Consuming alcohol reduces concentration and reaction time while driving.","options_ar":["نعم","لا"],"options_en":["Yes","No"],"imageURL":null,"correctIndex":0},
    {"text_ar":"إن وضع الأشیاء على الزجاج الأمامي أو أمام السائق یعیق من حركة الوسادة الھوائیة عند انتفاخھا .","text_en":"Placing objects on the windshield or in front of the driver obstructs airbag deployment.","options_ar":["نعم","لا"],"options_en":["Yes","No"],"imageURL":null,"correctIndex":0},
    {"text_ar":"یعاقب السائق بالحبس مدة لا تقل عن ثلاثة أشھر ولا تزید على ثلاث سنوات لمن ارتكب المخالفة التالیة ؟","text_en":"A driver is punished with imprisonment of 3 months to 3 years for the following violation:","options_ar":["إذا تسبب سائق المركبة أثناء قیادتھا بوفاة إنسان أو تسبب بإحداث عاھة دائمة له .","محاولة الھرب من مكان حادث ارتكبه .","عدم إعلام أول مركز أمني أو دوریة شرطه بحادث سیر ارتكبه أثناء قیادة مركبة وأدى إلى إصابة شخص."],"options_en":["Causing death or permanent disability while driving","Attempting to flee the scene of an accident","Failing to report an accident that caused injury"],"imageURL":null,"correctIndex":0}
    
]
